import { ToSUl, ToSWrap } from "../style"

export default function ToSText() {
  return (
    <ToSWrap>
      <h4>제 1 조 (목적) </h4>
      <p>본 약관은 미디어커뮤니케이션학부 멀티미디어 랩실(이하 “랩실측”이라 함)와 랩실에서 제공하는 대여 시스템(이하 “시스템”이라 함)을 이용하는 미디어커뮤니케이션학부생(이하 “학부생”이라 함)간의 권리, 의무를 규정함을 그 목적으로 합니다.</p>

      <h4>제 2 조 (용어 정의)</h4>
      <ToSUl>
        <li>대여(또는 임차)란 시스템이 학부생이 재학기간 동안 랩실측의 대여물품을 학부생에게 임대하는 것을 말합니다.</li>
        <li>기자재란 카메라・렌즈 및 촬영 기자재, 기타제품 등 대여를 목적으로 학부생에게 제공하는 모든 제품을 말합니다.</li>
        <li>랩실이란 이용을 목적으로 학부생에게 제공하는 공간을 의미합니다. 키를 대여해주어 공간을 이용할 수 있도록 합니다.</li>
        <li>대여기간이란 회사와 학부생이 상호 약정한 사용기간을 말합니다.</li>
        <li>수령일자 및 반납일자는 랩실이 학부생에게 대여제품을 인도하는 날과 학부생이 대여제품을 랩실로 반납하는 날을 말합니다.</li>
      </ToSUl>

      <h4>제 3 조 (약관의 명시)</h4>
      <ToSUl>
        <li>시스템은 이 약관의 내용을 학부생이 알 수 있도록 초기 서비스화면(전면)에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.</li>
        <li>랩실측은 약관의 규제 등에 관한 법률, 전자거래 기본법, 전자 서명법, 정보통신망 이용촉진 등에 관한 법률 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.</li>
        <li>개정된 약관은 적용일자 이전에 체결된 계약에 대해서도 적용됨을 원칙으로 합니다. 다만, 이용자가 개정된 약관의 적용을 거부할 뜻을 회사에 명시적으로 통지한 경우에는 개정 전의 약관을 적용합니다.</li>
        <li>이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한 관계법령 또는 상관례에 따릅니다.</li>
      </ToSUl>

      <h4>제 4 조 (대여신청)</h4>
      <ToSUl>
        <li>
          학부생은 대여 신청 시, 시스템 상에서 대여하고자 하는 제품을 확인한 후 아래의 방법에 의하여 제품 대여예약을 시스템을 이용해 신청합니다.
          <ul>
            <li>시스템 회원가입 학부생만 대여진행 가능</li>
            <li>시스템을 통해 제품의 정보 및 현황 확인</li>
            <li>대여하고자 하는 기자재의 수량(랩실의 경우 대여 가능 인원 및 여부), 대여기간, 반납일자 등 정확히 확인하고 본인의 실명과 전화번호, 이메일, 대여 목적 제공 후 예약</li>
          </ul>
        </li>
        <li>
          랩실측은 다음과 같은 사유가 발행한 경우 대여를 취소할 수 있습니다.
          <ul>
            <li>신청한 기자재의 재고가 없는 경우</li>
            <li>기자재 사용에 지장이 있거나 사용이 불가할 경우</li>
            <li>신청내용에 허위, 기재누락, 오기가 있는 경우</li>
            <li>기타 랩실이 합리적인 판단에 의하여 필요하다고 인정하는 경우</li>
          </ul>
        </li>
      </ToSUl>

      <h4>제 5 조 (대여 완료)</h4>
      <ToSUl>
        <li>대여는 랩실 측의 승인 없이 시스템 내에서 자동으로 처리됩니다.</li>
        <li>랩실측은 제 3 조 2번에 의거하여, 대여 완료를 확정 지었음에도 불구하고 대여를 취소할 수 있습니다.</li>
      </ToSUl>

      <h4>제 6 조 (대여 취소)</h4>
      <ToSUl>
        <li>대여가 완료된 기자재 및 랩실을 학부생의 사정에 의해 부득이 취소할 경우 수령일시 전일 취소신청을 하는 것을 원칙으로 합니다.</li>
        <li>당일 취소신청을 할 경우 랩실 측에 직접 전화하여 문의해야 합니다.</li>
      </ToSUl>

      <h4>제 7 조 (대여계약의 성립)</h4>
      <ToSUl>
        <li>랩실측의 모든 기자재는 학부생이 직접 대여한 시간에 방문하여 대여하는 것을 원칙으로 합니다. 단, 랩실측과 학부생의 별도 협의한 계약내용에 따라서 달라질 수도 있습니다.</li>
        <li>학부생은 기자재 및 랩실 키 수령 전에 대여 신청서를 재차 확인 받을 수 있습니다.</li>
        <li>대여계약은 학부생이 대여 신청서 및 수령인 확인 후, 랩실측이 기자재 및 랩실 키를 인도할 때 성립됩니다. 단, 동일한 랩실을 2팀 이상 대여하는 경우, 직접 대여하러 오는 팀이 아니더라도 1팀 이상 키를 수령했을 시 대여가 성립되며, 키 수령에 대한 공동 책임을 지게 됩니다. </li>
      </ToSUl>
      
      <h4>제 8 조 (반납의 의무)</h4>
      <ToSUl>
        <li>학부생이 직접 대여한 장소에서 계약서상에 명시된 반납시간에 직접 방문하여 반납하는 것을 원칙으로 합니다.</li>
        <li>랩실측은 학부생이 반납한 기자재 및 랩실 환경, 키의 이상유무를 확인하고 이상이 없을 시 정상 반납 처리합니다.</li>
      </ToSUl>

      <h4> 제 9 조 (학부생의 책임 및 의무)</h4>
      <ToSUl>
        <li>학부생이 대여한 기자재는 대여기간 중에도 그 소유가 랩실측에 있으므로 학부생은 기자재 및 랩실을 임의로 분해하거나 원형변경 또는 기자재의 경우 부품을 교체하면 안되며, 절대로 대여 기자재 및 랩실을 사용목적과 다르게 사용하면 안됩니다.</li>
        <li>학부생은 선량한 관리자의 주의의무를 가지고 대여기자재를 사용 및 보관해야 합니다.</li>
        <li>학부생에 의해 1, 2항에 해당되는 사고가 발생한 경우에 생기는 불이익은 학부생이 부담합니다.(패널티 부과, 비용 청구 등)</li>
        <li>학부생은 기자재 및 랩실 대여시 정확한 대여 목적을 밝히고 그 용도에 가장 적합한 상태의 기자재 및 랩실을 대여합니다.</li>
        <li>학부생이 사용 도중에 원인불명의 결함 및 문제가 발생하였을 때에는 즉시 랩실측에 연락을 취하여, 피해를 최소화시킬 수 있는 방법을 랩실측과 함께 모색합니다. 기자재 및 랩실의 결함 원인에 대한 책임소재는 추후에 상호간 납득할 수 있는 방법으로 확인하여 그에 따른 책임을 지도록 합니다.</li>
        <li>대여기간 중 혹은 대여기간이 끝난 후에도 학부생의 부주의, 실수, 고의 등으로 인한 대여기자재 및 랩실의 파손 및 이상이 명백한 경우에는 그 모든 책임이 학부생에 있으며, 대여기자재 및 랩실의 원상복귀를 위해 랩실측은 수리비 견적을 의뢰하여 학부생에게 청구하며 학부생은 청구한 수리비와 수리기간에 해당하는 대여금을 랩실측에 지불한다. 단 수리비 청구가 안 되는 경우에는 대체 구입비용을 랩실측에게 지급하며 구입비용 기준은 부품별 소비자 가액을 기준으로 합니다.</li>
        <li>대여기간 중 학부생의 부주의로 인하여 대여기자재 및 랩실 키를 도난 혹은 분실하였을 경우 학부생은 대여기자재 및 랩실 키의 시가에 해당하는 금액을 변상하거나 동일한 기자재를 직접 구입해서 변상해야 합니다. </li>
      </ToSUl>

      <h4>제 10조 (학부생의 금지행위)</h4>
      <ToSUl>
        <li>
          학부생은 대여기자재 및 랩실의 대여기간 중에 다음의 행위를 하여서는 안 됩니다.
          <ul>
            <li>대여한 기자재 및 랩실을 전대하거나 또는 담보에 공용하는 등 한의 소유권을 침해하는 일체의 행위를 하는 일</li>
            <li>임대차계약서에 명시된 계약자 이외의 타인 또는 타 기관에게 전대하는 일</li>
            <li>기타 학부생의 부당한 과실행위로 대여기자재 및 랩실을 손상시키는 일</li>
          </ul>
        </li>
      </ToSUl>

      <h4>제 11 조 (랩실측의 책임 및 의무) </h4>
      <ToSUl>
        <li>랩실측은 대여계약과 관련하여 취득한 학부생의 개인정보를 학부생의 사전 동의 없이 제3자에 유출하여서는 안 되며 이를 위반하여 그로 인해 발생 되는 손해에 대해서 그 위반 책임이 있는 자가 손해배상하고 민·형사상의 책임을 집니다.</li>
        <li>랩실측은 학부생과 계약한 내용에 맞는 기자재 및 랩실을 학부생의 사용용도에 맞게 안전하게 인도해야하는 의무가 있습니다.</li>
        <li>대여기간 중 랩실측의 귀책사유로 인한 기자재 결함 발생하여 학부생이 대여기자재 일부 또는 전체를 사용하지 못했을 경우에 한은 대체기자재를 최단기간 내에 학부생에게 보내는 데에 최선을 다 해야 합니다.</li>
      </ToSUl>

      <h4>제 12 조 (관할법원)</h4>
      <p>서비스와 관련하여 회사와 이용자 사이에 발생한 분쟁에 대해 소송이 제기될 경우에는 학교 소재지를 관할하는 법원을 합의관할법원으로 합니다.</p>

      <h4>제 13 조 (보칙) </h4>
      <ToSUl>
        <li>랩실측은 필요한 경우 이 약관에 준하여 따로 보칙을 정할 수 있습니다.</li>
        <li>랩실측은 새로운 보칙을 정하거나 기존의 약관을 변경할 필요가 있을 경우 웹사이트를 통하여 미리 공지한 후, 일시적 또는 영구적으로 수정하거나 중단할 수 있습니다.</li>
      </ToSUl>
      
      <h4>제 14 조 (분쟁의 처리 및 관할 법원)</h4>
      <ToSUl>
        <li>랩실측과 학부생간의 분쟁에 관한 소송은 한 해당지점 주소지 관할 법원에 제기할 수 있으며, 그 제기된 소송에는 대한민국법을 적용한다.</li>
        <li>학부생은 피해보상, 대여기자재에 대한 불만, 분쟁처리에 관해서는 한에 직접 문의하여 해결하고 해결이 불가할 경우 학교측에 구제를 신청할 수 있다.</li>
        <li>대여계약기간 이후의 문제에 관해서는 한은 책임지지 않는다.</li>
      </ToSUl>

      <h4>부 칙</h4>
      <p>본 약관은 2023년 6월 16일부터 시행 합니다.</p>
    </ToSWrap>
  )
}
